# Data Wrangling

In [3]:
import pandas as pd
url = "https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv" # cannot used
dataframe = pd.read_csv("data3.csv")
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

## 3.1 Creating a Data Frame

In [4]:
dataframe = pd.DataFrame()
dataframe['Name'] = ['Kenny','Johnson']
dataframe['Age'] = [22, 18]
dataframe['Driver'] = [True, False]
dataframe

      Name  Age  Driver
0    Kenny   22    True
1  Johnson   18   False

Actually, we can append a new row to the dataframe

In [6]:
new_person = pd.Series(['Molly',40,True],index=['Name','Age','Driver'])
dataframe.append(new_person, ignore_index=True)

      Name  Age  Driver
0    Kenny   22    True
1  Johnson   18   False
2    Molly   40    True

## 3.2 Describe the Data

In [8]:
dataframe = pd.read_csv("data3.csv")
dataframe.head(5), dataframe.shape, dataframe.describe(),dataframe.tail()

(                                            Name PClass    Age     Sex  \
 0                   Allen, Miss Elisabeth Walton    1st  29.00  female
 1                    Allison, Miss Helen Loraine    1st   2.00  female
 2            Allison, Mr Hudson Joshua Creighton    1st  30.00    male
 3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  25.00  female
 4                  Allison, Master Hudson Trevor    1st   0.92    male

    Survived  SexCode
 0         1        1
 1         0        1
 2         0        0
 3         0        1
 4         1        0  ,
 (1313, 6),
               Age     Survived      SexCode
 count  756.000000  1313.000000  1313.000000
 mean    30.397989     0.342727     0.351866
 std     14.259049     0.474802     0.477734
 min      0.170000     0.000000     0.000000
 25%     21.000000     0.000000     0.000000
 50%     28.000000     0.000000     0.000000
 75%     39.000000     1.000000     1.000000
 max     71.000000     1.000000     1.000000,
                         Name PClass   Age   Sex  Survived  SexCode
 1308      Zakarian, Mr Artun    3rd  27.0  male         0        0
 1309  Zakarian, Mr Maprieder    3rd  26.0  male         0        0
 1310        Zenni, Mr Philip    3rd  22.0  male         0        0
 1311        Lievens, Mr Rene    3rd  24.0  male         0        0
 1312          Zimmerman, Leo    3rd  29.0  male         0        0)

## 3.3 Navigating DataFrames

In [9]:
dataframe.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

we can set the index using one column

In [11]:
dataframe = dataframe.set_index(dataframe['Name'])
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

`loc` and `iloc` method also allow you to select a column

In [12]:
dataframe.iloc[0,2], dataframe.loc['Allen, Miss Elisabeth Walton','Age']

(29.0, 29.0)

## 3.4 Selecting Based on Conditions

In [13]:
dataframe[dataframe['Sex']=='female'].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [15]:
dataframe[(dataframe['Sex']=='female') & (dataframe['Age'] >= 65)]  # only & can be used

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Crosby, Mrs Edward Gifford (Catherine Elizabeth Halstead)","Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

## 3.5 Replacing Values

In [16]:
dataframe['Sex'].replace(["female","male"],["Woman","Man"]).head(5)

Name
Allen, Miss Elisabeth Walton                     Woman
Allison, Miss Helen Loraine                      Woman
Allison, Mr Hudson Joshua Creighton                Man
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    Woman
Allison, Master Hudson Trevor                      Man
Name: Sex, dtype: object

In [17]:
dataframe.replace(1,"Yes").head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29,female,Yes,Yes
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2,female,0,Yes

In [18]:
dataframe.head()  # indicating that replace method generate new dataframe

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [20]:
dataframe['Sex'].replace(["female","male"],["Woman","Man"], inplace=True) # if you wanna re
dataframe.head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,Woman,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,Woman,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,Man,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,Woman,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,Man,1,0

`replace` also accept **[regular expression](https://en.wikipedia.org/wiki/Regular_expression)**

In [21]:
dataframe.replace(r'1st','First',regex=True).head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",First,29.0,Woman,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",First,2.0,Woman,0,1

## 3.6 Renaming Columns

In [22]:
dataframe.rename(columns={'PClass':'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,Woman,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,Woman,0,1

change columns name in a loop

In [23]:
import collections
column_names = collections.defaultdict(str)
for name in dataframe.columns:
    column_names[name]
column_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

## 3.7 Finding the Minimum, Maximum, Sum, Average, and Count

In [24]:
dataframe['Age'].max(),dataframe['Age'].min(),dataframe['Age'].sum(),dataframe['Age'].mean(),dataframe['Age'].count()

(71.0, 0.17, 22980.88, 30.397989417989415, 756)

var, std, kurt([kurtosis](https://en.wikipedia.org/wiki/Kurtosis)), skew([skewness](https://en.wikipedia.org/wiki/Skewness)),sem([standard error of the mean](https://en.wikipedia.org/wiki/Standard_error)),mode([mode](https://en.wikipedia.org/wiki/Mode_(statistics)),median(median) are also supported.

In [25]:
dataframe['Age'].kurt(), dataframe['Age'].skew()

(-0.036536168924722556, 0.36851087371648295)

## 3.8 Finding Unique Values

In [26]:
dataframe['Sex'].unique()

array(['Woman', 'Man'], dtype=object)

alternatively,`value_counts` will display all unique values with the number of times each value appears

In [27]:
dataframe['Sex'].value_counts()

Man      851
Woman    462
Name: Sex, dtype: int64

if we just wanna figure out the number or unique values

In [28]:
dataframe['PClass'].nunique()

4

## 3.9 Handling Missing Value

In [29]:
# selecting missing value
dataframe[dataframe['Age'].isnull()].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Aubert, Mrs Leontine Pauline","Aubert, Mrs Leontine Pauline",1st,NaN,Woman,1,1
"Barkworth, Mr Algernon H","Barkworth, Mr Algernon H",1st,NaN,Man,1,0

In [34]:
dataframe.dropna()  # delete the observation which contain missing data

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,Woman,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,Woman,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,Man,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,Woman,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,Man,1,0
...,...,...,...,...,...,...
"Zakarian, Mr Artun","Zakarian, Mr Artun",3rd,27.00,Man,0,0
"Zakarian, Mr Maprieder","Zakarian, Mr Maprieder",3rd,26.00,Man,0,0
"Zenni, Mr Philip","Zenni, Mr Philip",3rd,22.00,Man,0,0
"Lievens, Mr Rene","Lievens, Mr Rene",3rd,24.00,Man,0,0
"Zimmerman, Leo","Zimmerman, Leo",3rd,29.00,Man,0,0

In [40]:
import numpy as np
# check if dataframe contain any missing data now
np.all((dataframe == np.nan)), np.any((dataframe == np.nan))

(False, False)

## 3.10 Deleting a Column

In [41]:
dataframe.drop('Age', axis=1).head(2)

,Name,PClass,Sex,Survived,SexCode
Name,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,Woman,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,Woman,0,1

## 3.11 Deleting a Row

In [42]:
dataframe[dataframe['Sex']=='Woman'].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,Woman,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,Woman,0,1

In [43]:
dataframe.index # sometimes we can drop a row by index...

Index(['Allen, Miss Elisabeth Walton', 'Allison, Miss Helen Loraine',
       'Allison, Mr Hudson Joshua Creighton',
       'Allison, Mrs Hudson JC (Bessie Waldo Daniels)',
       'Allison, Master Hudson Trevor', 'Anderson, Mr Harry',
       'Andrews, Miss Kornelia Theodosia', 'Andrews, Mr Thomas, jr',
       'Appleton, Mrs Edward Dale (Charlotte Lamson)',
       'Artagaveytia, Mr Ramon',
       ...
       'Yasbeck, Mr Antoni', 'Yasbeck, Mrs Antoni', 'Youssef, Mr Gerios',
       'Zabour, Miss Hileni', 'Zabour, Miss Tamini', 'Zakarian, Mr Artun',
       'Zakarian, Mr Maprieder', 'Zenni, Mr Philip', 'Lievens, Mr Rene',
       'Zimmerman, Leo'],
      dtype='object', name='Name', length=1313)

## 3.12 Dropping duplicate Rows

In [44]:
dataframe.drop_duplicates().head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,Woman,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,Woman,0,1

In [45]:
# to see how many duplicates we drop, just run code below
len(dataframe)-len(dataframe.drop_duplicates())

0

to drop subset of dataframe, apply `subset` parameter,if you wanna keep the latter observation, use `keep=last` parameter

In [46]:
dataframe.drop_duplicates(subset=['Sex'], keep='last')

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Zabour, Miss Tamini","Zabour, Miss Tamini",3rd,NaN,Woman,0,1
"Zimmerman, Leo","Zimmerman, Leo",3rd,29.0,Man,0,0

In [47]:
dataframe.drop_duplicates(subset=['Sex'])

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,Woman,1,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.0,Man,0,0

## 3.13 Grouping Rows by Values

In [48]:
dataframe.groupby('Sex').mean()

             Age  Survived  SexCode
Sex
Man    31.014338  0.166863      0.0
Woman  29.396424  0.666667      1.0

`groupby` method generate `DataframeGroupby object`

In [49]:
dataframe.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [51]:
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex    Survived
Man    0           32.320780
       1           25.951875
Woman  0           24.901408
       1           30.867143
Name: Age, dtype: float64

## 3.14 Grouping rows by time

In [54]:
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')
dataframe1 = pd.DataFrame(index=time_index)
dataframe1['Sale_Amount'] = np.random.randint(1, 10, 100000)
dataframe1.resample('W').sum()

            Sale_Amount
2017-06-11        86591
2017-06-18       100585
2017-06-25       100519
2017-07-02       100711
2017-07-09       100338
2017-07-16        10336

In [56]:
dataframe1.resample('2W').sum()

            Sale_Amount
2017-06-11        86591
2017-06-25       201104
2017-07-09       201049
2017-07-23        10336

## 3.15 Looping Over a Column

In [58]:
[name.upper() for name in dataframe['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

## 3.16 Applying a Function Over All Elements in a Column

In [59]:
def uppercase(name: str)-> str:
    return name.upper()

dataframe['Name'].apply(uppercase)[:2]

Name
Allen, Miss Elisabeth Walton    ALLEN, MISS ELISABETH WALTON
Allison, Miss Helen Loraine      ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

## 3.17 Applying a Function to Groups

In [60]:
dataframe.groupby('Sex').apply(lambda x:x.count())

       Name  PClass  Age  Sex  Survived  SexCode
Sex
Man     851     851  468  851       851      851
Woman   462     462  288  462       462      462

## 3.18 Concatenating DataFrames

use concat with axis = 0 to concatenate along the row axis

In [61]:
data_a = {'id':['1','2','3'],
         'first':['Alex','Amy','Allen'],
         'last':['Anderson','Ackerman','Ali']}
dataframe_a = pd.DataFrame(data_a, columns=data_a.keys())
data_b = {'id':['4','5','6'],
         'first':['Billy','Brian','Bran'],
         'last':['Bonder','Black','Balwner']}
dataframe_b = pd.DataFrame(data_b, columns=data_b.keys())
pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [62]:
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

## 3.19 Merging DataFrame

In [63]:
employee_data = {'id':['1','2','3','4'],
         'name':['Amy Jones','Allen Keys','Alice Bees', 'Tim Horton']}
sales_data = {'id':['3','4','5','6'],
             'total_sales':[23456,43423,23212,55433]}
dataframe_employee = pd.DataFrame(employee_data, columns=employee_data.keys())
dataframe_sales = pd.DataFrame(sales_data, columns=sales_data.keys())
pd.merge(dataframe_employee, dataframe_sales, on='id')

  id        name  total_sales
0  3  Alice Bees        23456
1  4  Tim Horton        43423

merge default to inner join. if we wanna outer join, we should change outer parameter

In [64]:
pd.merge(dataframe_employee, dataframe_sales, on='id', how='outer')

  id        name  total_sales
0  1   Amy Jones          NaN
1  2  Allen Keys          NaN
2  3  Alice Bees      23456.0
3  4  Tim Horton      43423.0
4  5         NaN      23212.0
5  6         NaN      55433.0

if we wanna specify left and right join, just change how parameter

In [66]:
pd.merge(dataframe_employee, dataframe_sales, on='id',how='left'),pd.merge(dataframe_employee, dataframe_sales, on='id',how='right')

(  id        name  total_sales
 0  1   Amy Jones          NaN
 1  2  Allen Keys          NaN
 2  3  Alice Bees      23456.0
 3  4  Tim Horton      43423.0,
   id        name  total_sales
 0  3  Alice Bees        23456
 1  4  Tim Horton        43423
 2  5         NaN        23212
 3  6         NaN        55433)